#include <iostream>

int main() {
	// Размерът е хубаво да бъде unsigned число(за предпочитане size_t).
	int n;
	std::cin >> n;

	// Нямаш валидация за n!!! Какво става, ако въведа отрицателна стойност или 0?

	// Нямаш std::nothrow за new, това е възможно да crash-не програмата, което е проблем.
	// Това се счита за сериозна грешки и се таксува тежко на контролни и изпит.
	int *a = new int[n];
	for(int i = 0; i < n; i++) {
		// Къде е структурата, която се изискваше да направите по условие?
		// Това не би се зачело като решение на контролно/изпит, че даже и на проект.
		// Този курс се учим да пишем правилно структуриран код, а не такъв, който просто "работи"!
		int x1, y1, x2, y2, x3, y3;
		std::cin >> x1 >> y1 >> x2 >> y2 >> x3 >> y3;
		a[i] = abs(x1*(y2-y3) + x2*(y3-y1) + x3*(y1-y2));
	}

	for(int i = 1; i < n; i++)
		for(int j = i; j > 0 && a[j-1] > a[j]; j--)
			std::swap(a[j-1], a[j]);

	for(int i = 0; i < n; i++)
		std::cout << a[i]/2.0 << " ";
	std::cout << std::endl;

	// Не освобождаваш заделената памет за a!!!!!!!
	// При две такива допуснати на контролно/изпит работата директно се анулира.

	return 0;
}

